[
  {
    "title": "PPRE Bukukan Laba Rp194,69 Miliar, Pertambangan Jadi PenopangKamis, 30/10/2025, 17:52 WIB",
    "source": "https://wartaekonomi.co.id/read588276/ppre-bukukan-laba-rp19469-miliar-pertambangan-jadi-penopang",
    "summary": "1. PT PP Presisi Tbk (PPRE) has reported a net profit of Rp194.69 billion for the third quarter of 2025, driven by strong performance from its mining and construction services, which have remained stable throughout the year.\n    2. The growth is attributed to consistent operational efficiency and good corporate management, as stated by the company's Financial and Human Capital Management Director, Mohammad Arif Iswahyudi, during the PP Presisi 2025 Public Expose held on October 30, 2025, at Wisma Subiyanto, Plaza PP, Jakarta Timur.\n    3. Looking ahead, PPRE plans to further strengthen its competence in the mining sector by enhancing heavy equipment productivity and implementing digital technology in operational activities. The mining sector is expected to be a key driver of the company's performance amidst the slowdown in infrastructure project development. The company also aims to expand its mining project portfolio, which has high growth potential."
  },
  {
    "title": "Kebijakan Moneter Ditantang Makin Populernya Stablecoin Dolar AS",
    "source": "https://wartaekonomi.co.id/read588157/kebijakan-moneter-ditantang-makin-populernya-stablecoin-dolar-as",
    "summary": "1. The growing popularity of US dollar-backed stablecoins poses significant challenges for global monetary policy in the coming year.\n    2. V. Anantha Nageswaran, an economic advisor in India, warns that the increasing use of stablecoins could potentially undermine the seigniorage of certain countries, affecting monetary transmission and monetary policy.\n    3. Nageswaran also suggests that stablecoins could become a new source of competition for the banking sector, particularly in the areas of financial intermediation and attracting deposits from customers."
  },
  {
    "title": "Laba Bersih Indosat (ISAT) Terpangkas Jadi Rp3,58 Triliun per Kuartal III 2025",
    "source": "https://wartaekonomi.co.id/read588224/laba-bersih-indosat-isat-terpangkas-jadi-rp358-triliun-per-kuartal-iii-2025",
    "summary": "1. PT Indosat Tbk (ISAT) has reported a decline in its quarterly earnings for Q3 2025, with a net profit of Rp3,58 trillion, a 7.49% year-on-year (YoY) decrease from Rp3,87 trillion in the same period last year.\n    2. The decline is also evident in revenue, with total revenue for ISAT falling 1.6% from Rp41,81 trillion to Rp41,16 trillion. The drop is primarily due to a decrease in the mobile segment, which fell 1.9% to Rp34.5 trillion, although the MIDI segment saw a slight increase to Rp6 trillion.\n    3. Meanwhile, fixed communication revenue was negatively impacted by a 9.9% decrease to Rp604 billion. Management explains that the decline in mobile revenue is mainly due to a drop in data, voice, and SMS, although there is still growth in value-added services and interconnection. On the other hand, the increase in MIDI revenue is due to growth in IT"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924736/saham-goto-melesat-714-usai-rilis-laporan-keuangan-kuartal-iii-2025",
    "source": "https://market.bisnis.com/read/20251030/7/1924736/saham-goto-melesat-714-usai-rilis-laporan-keuangan-kuartal-iii-2025",
    "summary": "1. Shares of GoTo Gojek Tokopedia Tbk (GOTO) surged by 7.14% to Rp60 per share on the Indonesia Stock Exchange on Thursday (30/10), a day after the company released its Q3 2025 financial report and 9-month financial report for the year. The company reported an adjusted pre-tax profit of Rp62 billion for Q3 2025, marking the first time in the company's history and a significant increase from Rp728 billion year-on-year (YoY). This achievement brings GOTO closer to achieving a positive net income. In line with this, the company raised its EBITDA guidance for the full year 2025 from Rp1.4-1.6 trillion to Rp1.8-1.9 trillion.\n\n2. GoTo's net income for Q3 2025 was recorded at Rp4.74 trillion, up 21% compared to Q3 2024 which was Rp3.93 trillion. For the first 9 months of"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924654/harapan-pelaku-pasar-modal-soal-target-anyar-bei-di-2026",
    "source": "https://market.bisnis.com/read/20251030/7/1924654/harapan-pelaku-pasar-modal-soal-target-anyar-bei-di-2026",
    "summary": "the Indonesia Stock Exchange (BEI) has set a target for average daily transaction value (RNTH) of IDR 14.5 trillion and 50 IPOs for 2026. Despite some targets not meeting the 2025 targets, some market players view this as a reasonable step. For your information, the BEI set a daily transaction value target of IDR 16.5 trillion for the past three months. Meanwhile, the BEI also revised its IPO target from 66 to 45 companies for this year. With that, the IPO target for next year is lower than the original target set by the BEI. Managing Director Research Samuel Securities Indonesia, Harry Su, views the BEI's conservative approach to lowering the target for 2026 as cautious, but many see it as a step towards adjusting to market dynamics and improving liquidity quality, which has become a concern. According to Harry, the BEI should focus on strengthening its early detection system for manipulative activities in the Indonesian capital market, while at the same time promoting investor education to be more critical of high-risk stocks. \"On the"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924637/pengertian-dan-cara-membaca-relative-rotation-graph-rrg-saham-sektoral",
    "source": "https://market.bisnis.com/read/20251030/7/1924637/pengertian-dan-cara-membaca-relative-rotation-graph-rrg-saham-sektoral",
    "summary": "1. The Relative Rotation Graph (RRG) is a technical analysis tool used by market players to measure and plot the relative performance of sector stocks against a benchmark index.\n    2. The RRG concept was first introduced by Julius de Kempenaer, a Dutch technical analyst, in the early 2000s, to graphically represent the relative relationship among various sector stocks within a single graph that is easy to read and interpret.\n    3. The RRG chart is divided into four quadrants, namely Leading, Weakening, Lagging, and Improving, which represent the relative strength cycles of a stock or sector compared to the benchmark. The direction and speed of rotation of the points in the chart are important indicators for reading potential market shifts."
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924542/rekomendasi-saham-dan-pergerakan-ihsg-hari-ini-kamis-30-oktober-2025",
    "source": "https://market.bisnis.com/read/20251030/7/1924542/rekomendasi-saham-dan-pergerakan-ihsg-hari-ini-kamis-30-oktober-2025",
    "summary": "1. The Jakarta Composite Index (IHSG) closed higher yesterday, with key stocks such as BBCA, MDKA, and ANTM supporting the rise. The IHSG closed up 0.91% or 73.59 points to 8,166.22. A total of 355 stocks closed higher, 316 stocks closed lower, and 140 stocks remained unchanged from the opening price. The IHSG moved between 8,042 and 8,169 throughout the day.\n    2. The context suggests that the IHSG's upward movement is being driven by large-cap stocks like BBCA, which closed up 3.93% to IDR 8,600, ADRO, which rose 8.40% to IDR 1,935, BBRI, which increased 1.04% to IDR 3,890, and BMRI, which climbed 3.10% to IDR 4,650. Other large-cap stocks contributing to the rise include MDKA, which closed up 13.3"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924586/indeks-bisnis-27-dibuka-menguat-terdorong-laju-saham-amrt-bmri-hingga-akra",
    "source": "https://market.bisnis.com/read/20251030/7/1924586/indeks-bisnis-27-dibuka-menguat-terdorong-laju-saham-amrt-bmri-hingga-akra",
    "summary": "1. The Jakarta Composite Index (JCI) opened higher today, driven by gains in shares such as AMRT, BMRI, and AKRA. As of 9:05 AM WIB, the JCI, a joint effort between the Indonesia Stock Exchange and Daily Bisnis Indonesia, opened at 548,95, a 0.17% increase for the day. Out of the 27 constituents, 15 stocks rose, 9 declined, and 3 remained unchanged.\n\n2. The rise in share prices was led by PT Sumber Alfaria Trijaya Tbk. (AMRT), which rose 2.49%. Following closely were PT Bank Mandiri (Persero) Tbk. (BMRI), which rose 1.72%, and PT AKR Corporindo Tbk. (AKRA), which rose 1.64%. Other notable gains were seen in PT Bank Syariah Indonesia Tbk. (BRIS), which rose 1.15%, PT Medikaloka Hermina Tbk. (HEAL), which rose 1.01%, PT Charoen Pokphand Indonesia T"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924580/bei-akan-pompa-free-float-emiten-jadi-25-dari-kapitalisasi-pasar",
    "source": "https://market.bisnis.com/read/20251030/7/1924580/bei-akan-pompa-free-float-emiten-jadi-25-dari-kapitalisasi-pasar",
    "summary": "Indonesian Stock Exchange (BEI) is working to increase the number of shares held by the public, or free float, to 25% of the market capitalization of listed companies. Jeffrey Hendrik, Director of Development at BEI, stated that the process of increasing free float is currently ongoing. He mentioned that BEI aims for free float to continue increasing. \"At least for the evaluation of constituents of LQ45 this month, it has already been implemented with a minimum of 10% [free float],\" said Jeffrey in Jakarta, Wednesday (29/10/2025). He explained that at present, the shares of companies included in the LQ45 index have already implemented a minimum free float of 10%. He added that some companies have been removed as constituents of LQ45 because they do not meet the free float requirements. Previously, Director of Valuation of Companies I Gede Nyoman Yetna stated that BEI plans to make adjustments to the classification of free float based on tiering of market capitalization after the public offering. Based on simulation back testing of listed companies, if the new classification proposal is used, some companies will have a minimum high free"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924582/ihsg-dibuka-bertenaga-usai-the-fed-pangkas-suku-bunga",
    "source": "https://market.bisnis.com/read/20251030/7/1924582/ihsg-dibuka-bertenaga-usai-the-fed-pangkas-suku-bunga",
    "summary": "1. The Indonesian Stock Exchange Composite Index (IHSG) opened higher today, reaching 8.177,83, boosted by shares such as PT Bank Mandiri (Persero) Tbk. (BMRI) and PT Bank Rakyat Indonesia (Persero) Tbk. (BBRI). The increase in IHSG was driven by the Federal Reserve's decision to cut the federal funds rate by 25 basis points in its policy meeting that ended on Wednesday (29/10/2025).\n\n2. The market context is influenced by the Fed's decision to lower interest rates, which could potentially stimulate economic growth and increase investor confidence. However, the potential implications are not yet clear, as other factors such as the Bank of Japan's interest rate decision, German and Euro Area GDP growth data, and European Central Bank monetary policy decisions are also expected today.\n\n3. Investors are keeping a close eye on these upcoming events, as they could further impact the direction of the IHSG. It's important to note that investment decisions are solely the responsibility of the reader, and Bisnis.com is not liable for any losses"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924581/ihsg-dibuka-menguat-terdorong-kenaikan-saham-bmri-bbri-hingga-goto",
    "source": "https://market.bisnis.com/read/20251030/7/1924581/ihsg-dibuka-menguat-terdorong-kenaikan-saham-bmri-bbri-hingga-goto",
    "summary": "BisnisPro, the Jakarta stock market index (IHSG) opened higher today, driven by the rise in bank stocks, following the Federal Reserve's decision to lower interest rates by 25 basis points. As of this writing, the IHSG is trading at 8.176,36, up from its opening level. However, it later fell by 5.16 points or 0.06% to 8.161,05. On Wednesday, the IHSG closed up 0.91% or 73,59 points at 8.166,22. The movement of the IHSG this morning is primarily influenced by the movement of bank stocks. The shares of PT Bank Central Asia Tbk. (BBCA) fell 0.29% to Rp8.575 per share at the start of trading today. Meanwhile, the shares of PT Bank Mandiri (Persero) Tbk. (BMRI) rose 1.08% to Rp4.700, the shares of PT Bank Rakyat Indonesia (Persero) Tbk. (BBRI) rose"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924565/bursa-asia-variatif-imbas-wanti-wanti-soal-pemangkasan-suku-bunga-lanjutan",
    "source": "https://market.bisnis.com/read/20251030/7/1924565/bursa-asia-variatif-imbas-wanti-wanti-soal-pemangkasan-suku-bunga-lanjutan",
    "summary": "1. The Asian stock market fluctuated on Thursday (30/10/2025) after Federal Reserve Chair Jerome Powell warned that the tapering of long-term interest rates was not yet certain, including the possibility of a cut in December. The Japanese Topix index rose 0.42% to 3,291,87, while the Korean Kospi index increased 1.14% to 4,127,49 after the US and South Korea reached a trade agreement. The Australian S&P/ASX 200 index fell 0.26% to 8,903,20. Meanwhile, US futures contracts moved erratically between gains and losses.\n\n2. After the Fed lowered interest rates twice to support a weakening labor market and plans to end asset purchases on December 1, Powell emphasized caution regarding the next step and highlighted the risk to the labor market, causing investors to reduce their expectations for further stimulus. The market is now waiting for signals from the Bank of Japan (BOJ) and the European Central Bank, as well as a meeting between US President Donald Trump and Chinese President Xi Jinping,"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/7/1924566/ihsg-uji-resistance-8200-cek-saham-bmri-antm-hingga-asii",
    "source": "https://market.bisnis.com/read/20251030/7/1924566/ihsg-uji-resistance-8200-cek-saham-bmri-antm-hingga-asii",
    "summary": "Bisnis.com, Jakarta - The Jakarta Composite Index (IHSG) is expected to rise today, Thursday (30/10/2025). Shares such as BMRI, ANTM, up to ASII are potential choices. According to Phintraco Research, technically, the MACD histogram is still in the negative area and the Stochastic RSI is still pointing down in the pivot area. The buying volume indicates a strengthening trend supported by the A/D line, indicating accumulation. \"IHSG closed above the MA20 level, but still below the MA5 level, so it is expected that IHSG in the short term will tend to rise and test resistance 8.200-8.250,\" writes Phintraco Securities, Thursday (30/10/2025). Previously, IHSG closed up at the level 8.166,22 or up 0.91% during the trading on Wednesday (29/10/2025). IHSG opened up and briefly fell, but then reversed direction in the positive territory supported by the strengthening of large"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924488/sinyal-fase-bearish-saham-sektor-teknologi-usai-nikmati-lonjakan-tertinggi",
    "source": "https://market.bisnis.com/read/20251029/7/1924488/sinyal-fase-bearish-saham-sektor-teknologi-usai-nikmati-lonjakan-tertinggi",
    "summary": "1. The technology sector IDXTECHNO on the Indonesia Stock Exchange (IDX) closed bearish on Wednesday (29/10/2025) with a 0.66% decline to 9,681. This sector has been the leader in stock market performance this year with a year-to-date (YtD) gain of 142.16%. However, data indicates that the technology sector is poised to enter a bearish phase. According to the Relative Rotation Graph (RRG) as of October 21, 2025, IDXTECHNO is now in the weakening quadrant, with both the RS-Momentum and RS-Ratio moving towards levels approaching 100. Senior Market Analyst Mirae Asset Securities M. Nafan Aji Gusta views this sector rotation as bearish. Given that IDXTECHNO was previously in the leading quadrant with percentage gains in the hundreds since the start of the year, \"technology stocks are overbought and beginning to feel the pressure of profit-taking, which is a normal response given that the stocks are already overval"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924469/kinerja-keuangan-cetak-rekor-goto-revisi-naik-pedoman-kinerja-tahun-2025",
    "source": "https://market.bisnis.com/read/20251029/7/1924469/kinerja-keuangan-cetak-rekor-goto-revisi-naik-pedoman-kinerja-tahun-2025",
    "summary": "1. PT GoTo Gojek Tokopedia Tbk (GOTO) has reported a record-breaking financial performance for the September 2025 quarter, with a pre-tax profit of Rp62 billion for the last three months, marking the first time the company has achieved such a figure. This positive result has led to an upward revision of the company's EBITDA guidance for the full year 2025, from Rp1.4-1.6 trillion to Rp1.8-1.9 trillion, reflecting confidence in the company's ability to sustain growth and create long-term value for all stakeholders.\n\n2. The strong performance was driven by the on-demand service segment through Gojek, which saw a 10% increase in quarterly revenue to Rp3.21 trillion, and a 18% increase in revenue for the nine-month period to Rp9.20 trillion. The fintech segment through GoTo Financial also saw a 55% increase in quarterly revenue to Rp1.54 trillion, and a 71% increase in revenue for the nine-month period"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924461/pelaku-pasar-buka-suara-soal-target-ipo-hingga-transaksi-bei-2026",
    "source": "https://market.bisnis.com/read/20251029/7/1924461/pelaku-pasar-buka-suara-soal-target-ipo-hingga-transaksi-bei-2026",
    "summary": "the financial market has expressed concerns about the target IPO and daily transaction value (RNTH) set by the Indonesia Stock Exchange (BEI) for 2026. However, this is not seen as a sign of pessimism from the BEI, but rather a focus on the quality of the capital market rather than the quantity of the target. The BEI aims to have an average daily transaction value (RNTH) of IDR 14.5 trillion and 50 listed companies through IPO in 2026. This target RNTH is lower compared to the realizations of the last three months, which were IDR 16.5 trillion. Meanwhile, the BEI also revised its IPO target from 66 companies to 45 companies this year. With that, the IPO target for next year is smaller compared to the initial year target set by the BEI. However, Head of Research Kiwoom Securities Liza Camelia, views that the BEI's decision to lower the RNTH is not a sign of pessimism towards the market conditions next year. Instead, it is a realistic move taken by the BEI. \""
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924445/bei-targetkan-ipo-2026-ada-50-emiten-konservatif-atau-realistis",
    "source": "https://market.bisnis.com/read/20251029/7/1924445/bei-targetkan-ipo-2026-ada-50-emiten-konservatif-atau-realistis",
    "summary": "Bursa Efek Indonesia (BEI) has set a target of 50 Initial Public Offerings (IPOs) for the year 2026, with an average daily transaction value (RNTH) of Rp14.5 trillion. Market players view this target as realistic. A financial analyst from Universitas Indonesia, Budi Frensidy, considers the average daily transaction value target for the following year as conservative, at Rp14.5 trillion. \"However, the number of IPOs, up to 50 companies, may be realistic, especially if BEI indeed prioritizes quality over quantity and given that the target for this year has been reduced to 45 companies,\" Budi said, on Wednesday (29/10/2025). Budi further stated that in 2026, BEI has a crucial task to be built like the IT scam that harms investors, in addition to dealing with manipulative practices in other areas. \"What also needs to be built, in addition to dealing with manipulative practices in other areas, is the issue of IT scams that harm investors. Therefore, investor protection is needed,\" Budi"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924444/turuti-purbaya-bei-bentuk-tim-khusus-pelototi-saham-gorengan",
    "source": "https://market.bisnis.com/read/20251029/7/1924444/turuti-purbaya-bei-bentuk-tim-khusus-pelototi-saham-gorengan",
    "summary": "the Ministry of Finance, Purbaya Yudhi Sadewa, has requested the Indonesia Stock Exchange (BEI) to monitor the stock market for food and beverage (F&B) companies. The BEI will form a special team to oversee these stocks. BEI's Director of Development, Jeffrey Hendrik, explained that a team will be formed by the BEI to oversee F&B stocks. \"Our main focus is always on investor protection. The BEI will work hard for this,\" Jeffrey said at the Indonesia Stock Exchange Building, Jakarta, Wednesday (29/10/2025). Before this, Minister of Finance Purbaya Yudhi Sadewa stated that the Ministry of Finance will not provide incentives to the capital market before the BEI regulates investor behavior in the market, including controlling F&B stocks. This was stated by Purbaya during his visit to the BEI early this month. \"The BEI also asked for incentives that I have not given yet. So, I said I will give incentives when the investor behavior in the market is regulated,\" said Purbaya at the Indonesia Stock Exchange Building, Jakarta, Thursday (9"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924427/indeks-bisnis-27-ditutup-menguat-saham-dsng-myor-hingga-scma-di-zona-hijau",
    "source": "https://market.bisnis.com/read/20251029/7/1924427/indeks-bisnis-27-ditutup-menguat-saham-dsng-myor-hingga-scma-di-zona-hijau",
    "summary": "1. The Jakarta Composite Index (IHSG) closed higher today, with stocks such as DSNG, MYOR, and SCMA also rising, indicating a broad-based market uptrend.\n    2. Key drivers of the market rally include PT Dharma Satya Nusantara Tbk. (DSNG), PT Mayora Indah Tbk. (MYOR), and PT Surya Citra Media Tbk. (SCMA), which saw gains of 6.71%, 4.91%, and 4.85% respectively.\n    3. Conversely, the market also saw declines in stocks like PT Sumber Alfaria Trijaya Tbk. (AMRT), PT Telkom Indonesia (Persero) Tbk. (TLKM), PT Indosat Tbk. (ISAT), and PT Mitra Keluarga Karyasehat Tbk. (MIKA), which fell by 3.37%, 3.24%, 2.31%, and 1.13% respectively. The potential implications of this market movement suggest a mixed outlook, with some sectors experiencing"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924404/ihsg-hari-ini-2910-ditutup-di-level-8166-naik-091",
    "source": "https://market.bisnis.com/read/20251029/7/1924404/ihsg-hari-ini-2910-ditutup-di-level-8166-naik-091",
    "summary": "BisnisPro\n     Bisnis.com, The Jakarta Composite Index (IHSG) closed higher today, up 0.91%. Key stocks supporting the index's rise include BBCA, MDKA, ANTM, and others. According to RTI Business data, the IHSG closed at 8,166.22, up 73.59 points. A total of 355 stocks closed higher, 316 stocks closed lower, and 140 stocks remained unchanged from the opening price. Throughout the day, the index moved between 8,042 and 8,169. Among the large-cap stocks supporting the IHSG's rise are PT Bank Central Asia Tbk. (BBCA), which closed up 3.93% at Rp8,600, PT Alamtri Resources Indonesia Tbk. (ADRO), up 8.40% at Rp1.935, PT Bank Rakyat Indonesia (Persero) Tbk. (BBRI), up 1.04% at Rp3.890, and PT Bank Mandiri"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924396/chengdong-kembali-jual-saham-bumi-resources-bumi",
    "source": "https://market.bisnis.com/read/20251029/7/1924396/chengdong-kembali-jual-saham-bumi-resources-bumi",
    "summary": "Chengdong Investment Corporation, a Chinese corporation, has sold shares of PT Bumi Resources Tbk (BUMI), a coal mining group owned by the Bakrie and Salim groups, at the end of October 2025. According to data from PT Kustodian Sentral Efek Indonesia (KSEI) on Wednesday (29/10/2025), the company owned by China held 32.679.645.430 shares or 8.8% on Tuesday (28/10/2025). This number is down 58.18 million from 32.737.828.130 shares or 9.1% on Monday (27/10/2025). Chengdong's actions continue the company's decision to reduce its stake in BUMI. Bisnis.com reports that Chengdong has sold 2.53 billion shares of BUMI in stages since December 2024 to June 2025. These transactions were carried out with a price range from Rp108 to Rp14"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924390/chandra-asri-tpia-borong-aset-di-singapura-siap-investasi-rp166-triliun",
    "source": "https://market.bisnis.com/read/20251029/7/1924390/chandra-asri-tpia-borong-aset-di-singapura-siap-investasi-rp166-triliun",
    "summary": "PT Chandra Asri Pacific Tbk (TPIA) is preparing to invest $1 billion (approximately Rp16.6 trillion) and acquire assets in Singapore to strengthen its position as a regional energy and petrochemical player. Recently, Chandra Asri Group acquired the retail gas station network branded Esso, owned by ExxonMobil in Singapore, through a fully-owned subsidiary. The Chief Financial Officer (CFO) of Chandra Asri, Andre Khor, emphasized that this move is more than just expansion. \"This historic acquisition is more than just expansion, it is a transformation for us,\" said Andre Khor, during the Asian Downstream Summit at the Singapore International Energy Week (SIEW) 2025, Wednesday (29/10/2025). In April, Chandra Asri Group and Glencore announced the successful completion of the acquisition of Shell Singapore Pte. Ltd. (SSPL) in Shell Energy and Chemicals Park (SECP) in Singapore. SECP is now known as Aster Energy and Chemicals Park. According to him, the acquisition was done in conjunction with a commitment to invest $1"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924356/bei-targetkan-ipo-2025-jadi-45-perusahaan-tambah-3-lagi-sekelas-cdia-ratu",
    "source": "https://market.bisnis.com/read/20251029/7/1924356/bei-targetkan-ipo-2025-jadi-45-perusahaan-tambah-3-lagi-sekelas-cdia-ratu",
    "summary": "1. The Jakarta Stock Exchange (BEI) has lowered its target for Initial Public Offerings (IPOs) this year from 66 to 45 companies, with 23 IPOs already registered and 13 more in the pipeline.\n    2. BEI aims to register 50 IPOs next year, and has also set a target for various financial products such as bonds, exchange-traded funds (ETFs), exchange-traded notes (EBA), structured warrants, and derivatives.\n    3. BEI is also focusing on quality rather than quantity, with a target of 5 lighthouse IPOs this year, and an additional 3 in the pipeline. The aim is to attract more large companies to the capital market."
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924320/apa-itu-msci-daftar-saham-dan-mengapa-penting-bagi-investor",
    "source": "https://market.bisnis.com/read/20251029/7/1924320/apa-itu-msci-daftar-saham-dan-mengapa-penting-bagi-investor",
    "summary": "Morgan Stanley Capital International (MSCI) is a leading research company based in the United States. According to Investopedia, MSCI is an investment research company that performs indexing, risk analysis, and performance portfolio analysis, and provides governance tools to institutional investors and hedge funds. Morgan Stanley was founded by Henry S. Morgan and Harold Stanley in 1935, initially focusing on investment banking. Over time, the business grew, and in 1986, Morgan Stanley purchased the license for Capital International, the first company to introduce global stock market indices outside the US. Since then, MSCI has used the acronym MSCI. In 2004, MSCI acquired Barra. In its 2004 release, MSCI explained that Barra was a risk management and portfolio analysis company. MSCI hoped that with this acquisition, it would become the global leader in index benchmarking and risk management. The Barra acquisition cost $816.4 million. Today, MSCI is known as a global index provider used as a benchmark by international investors. The inclusion of a stock in the MSCI index has significant implications for the stock's performance,"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924314/target-bei-di-2026-50-ipo-baru-transaksi-harian-tembus-rp145-triliun",
    "source": "https://market.bisnis.com/read/20251029/7/1924314/target-bei-di-2026-50-ipo-baru-transaksi-harian-tembus-rp145-triliun",
    "summary": "1. The Indonesia Stock Exchange (BEI) has set a new target for 2026, aiming for a daily transaction value (RNTH) of Rp14.5 trillion, with an expected 50 new IPOs.\n    2. The context is that the BEI is aiming to register 555 new securities this year, up from around 400 in the previous year, with a target of 45 IPOs this year, down from 66 at the start of the year.\n    3. The potential implications of these targets are that the BEI is optimistic about the growth of the stock market and the number of new IPOs, with an increase in the number of Lighthouse IPOs to 6 companies. The BEI is also targeting 2 million new market investors in 2026. However, it is important to note that investment decisions are ultimately the responsibility of the reader, and Bisnis.com is not responsible for any losses or gains resulting from investment decisions based on this news."
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924194/rekomendasi-saham-dan-pergerakan-ihsg-hari-ini-rabu-29-oktober-2025",
    "source": "https://market.bisnis.com/read/20251029/7/1924194/rekomendasi-saham-dan-pergerakan-ihsg-hari-ini-rabu-29-oktober-2025",
    "summary": "1. The Indonesian Composite Index (IHSG) closed lower today, with heavyweight stocks such as DSSA, AMMN, and ASII experiencing declines. The IHSG closed at 8.092,63, a 0.30% decrease from the previous day. Throughout the day, the IHSG briefly touched levels of 8.039,85-8.151,34. Out of the index's constituents, 359 stocks rose, 324 fell, and 273 remained unchanged. Leading the correction was PT Dian Swastatika Sentosa Tbk. (DSSA), which fell 4.98% to IDR 84.375. Following closely behind were PT Amman Mineral Internasional Tbk. (AMMN), which fell 4.51% to IDR 6.875, and PT Astra International Tbk. (ASII), which fell 4.17% to IDR 6.325.\n\n2. The market context suggests that the IHSG'"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924256/saham-myor-bris-hingga-brpt-kompak-hijau-saat-indeks-bisnis-27-dibuka-melemah",
    "source": "https://market.bisnis.com/read/20251029/7/1924256/saham-myor-bris-hingga-brpt-kompak-hijau-saat-indeks-bisnis-27-dibuka-melemah",
    "summary": "Bisnis.com, Jakarta - The Bisnis-27 index opened lower today, despite the IHSG (Composite Stock Price Index) gaining ground on Wednesday (29/10/2025). However, several stocks such as MYOR, BRIS, HEAL, and BRPT remained in the green zone. According to data from the Indonesia Stock Exchange (BEI), the index, which is a joint effort between the exchange and Bisnis Indonesia, fell 0.19% to 539.88 until 9.02 WIB. Notably, 15 stocks rose, 9 were flat, and 3 declined. The stock with the highest price increase was led by PT Mayora Indah Tbk. (MYOR) by 2.68% to IDR 2,300, followed by PT Bank Syariah Indonesia Tbk. (BRIS) which appreciated 1.17% to IDR 2,590 per share. Other rising stocks were PT Medikaloka Hermina Tbk. (HEAL) with a 1% increase to IDR 1.515, while PT Bar"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924241/ihsg-dibuka-menguat-hari-ini-2910-saham-cuan-cdia-cs-melaju",
    "source": "https://market.bisnis.com/read/20251029/7/1924241/ihsg-dibuka-menguat-hari-ini-2910-saham-cuan-cdia-cs-melaju",
    "summary": "Indeks harga saham gabungan (IHSG) opened higher today, October 29, 2025. Shares such as CUAN, CDIA, and BRPT rose in the green zone during the opening trade. As of the data at 9:05 AM WIB, IHSG opened at 8.096,40 or an increase of 0.05% in today's trading. Out of hundreds of constituents, 287 stocks rose, 197 fell, and 472 stocks remained stagnant. The index then fell into the red zone at 9:13 AM WIB. During the uptrend, capital-heavy stock sectors led the way, with PT Petrindo Jaya Kreasi Tbk. (CUAN) rising 3.00% to IDR 2.060, followed by PT Chandra Daya Investasi Tbk. (CDIA) rising 1.72% to IDR 1.770, and PT Barito Pacific Tbk. (BRPT) rising 0.88% to IDR"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924224/ubah-metodologi-free-float-bei-bakal-diskusi-dengan-msci",
    "source": "https://market.bisnis.com/read/20251029/7/1924224/ubah-metodologi-free-float-bei-bakal-diskusi-dengan-msci",
    "summary": "the Indonesia Stock Exchange (BEI) will hold discussions with MSCI regarding the change in the free float calculation methodology within the MSCI index. Ignatius Denny Wicaksono, Head of Business Development 2 BEI, stated that due to the change in methodology, the BEI is currently working with the Central Securities Depository Indonesia (KSEI) to ensure that the data provided in the future is accessible. Therefore, users of indices such as MSCI and FTSE should have the same understanding in calculating free float. \"Later, users of indices such as MSCI and FTSE, we should all have the same understanding in calculating free float,\" said Denny, Tuesday (28/10/2025). Denny also stated that the BEI is also able to discuss with MSCI to ensure that their expectations are aligned and appropriate. \"We don't want anything excessive to be applied to the Indonesian capital market, as there is actually nothing special about it,\" he said. He also stated that the BEI is continuing efforts to help Indonesian companies enter global indices such as MSCI or FTSE. According to him, the BEI hopes"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924208/waspada-ihsg-diproyeksi-uji-level-8000-cek-saham-myor-lsip-hingga-mbma",
    "source": "https://market.bisnis.com/read/20251029/7/1924208/waspada-ihsg-diproyeksi-uji-level-8000-cek-saham-myor-lsip-hingga-mbma",
    "summary": "BisnisPro\n     Bisnis.com , JAKARTA — The Jakarta Composite Index (IHSG) is projected to test the level 8,000 today, Wednesday (29/10/2025). MYOR, LSIP, and MBMA are potential stocks today. According to Phintraco Securities research, technically, the negative MACD histogram is widening again and the Stochastic RSI is still trending downward in the pivot area. Volume selling still dominates, reinforced by the A/D line indicating distribution. The IHSG is below MA5 and MA20, and approaching MA50 at 8.010. The IHSG is heading towards the lower band, indicating a consolidation phase weakening. \"It is expected that the IHSG may test the psychological level 8,000 and if it breaks below, it may head towards support 7,850,\" said Phintraco Securities. Previously, the IHSG closed down at the level 8.092,63 or down 0.30% during Tuesday (28/10/"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251029/7/1924178/wall-street-cetak-rekor-lagi-tersulut-reli-saham-nvidia",
    "source": "https://market.bisnis.com/read/20251029/7/1924178/wall-street-cetak-rekor-lagi-tersulut-reli-saham-nvidia",
    "summary": "1. The S&P 500, Nasdaq Composite, and Dow Jones Industrial Average reached new record highs on Tuesday (28/10/2025) driven by the surge of Nvidia shares following the announcement of building supercomputers for AI. The positive performance was also supported by investor optimism towards the upcoming earnings reports of large tech companies.\n\n2. Nvidia plans to build seven AI supercomputers for the US Department of Energy and currently has a $500 billion chip AI order. Nvidia also announced a new partnership with Finnish tech company Nokia to explore the AI-based communications market. Microsoft shares also rose after the company reached an agreement that allows OpenAI to become a public company, with Microsoft owning 27% of the ChatGPT developer.\n\n3. Investors are now waiting for the earnings reports from Apple, Microsoft, Alphabet, Amazon, and Meta Platforms, scheduled for release in the coming days, with a focus on AI investments. The market momentum and strong earnings so far have pushed indices to higher levels. Additionally, there is optimism surrounding President Trump's visit to Asia. The performance of companies so far this"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251028/7/1924110/purbaya-perkirakan-ihsg-naik-dari-9000-ke-32000-pada-akhir-2035",
    "source": "https://market.bisnis.com/read/20251028/7/1924110/purbaya-perkirakan-ihsg-naik-dari-9000-ke-32000-pada-akhir-2035",
    "summary": "1. Minister of Finance Purbaya Yudhi Sadewa predicts that the IHSG (Indonesian Stock Exchange Composite Index) could reach 32,000 by the end of 2035.\n    2. This optimistic outlook is based on the assumption that fiscal policy can influence market sentiment. Purbaya believes that the fundamental factors driving the market are significant, which could lead to the index rising above current levels.\n    3. If this prediction holds true, the IHSG could potentially quadruple its current value by 2035, indicating a bullish market outlook for the Indonesian stock exchange."
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251028/7/1924131/emiten-sektor-kesehatan-klbf-hingga-sraj-tahan-tekanan-di-tengah-lesunya-ihsg",
    "source": "https://market.bisnis.com/read/20251028/7/1924131/emiten-sektor-kesehatan-klbf-hingga-sraj-tahan-tekanan-di-tengah-lesunya-ihsg",
    "summary": "BisnisPro\n     Bisnis.com , JAKARTA - Di tengah pelemahan Indeks Harga Saham Gabungan (IHSG) pada perdagangan pekan ini, sektor kesehatan menjadi salah satu yang paling tangguh. Analis menilai, ketahanan sektor ini ditopang oleh posisi industri kesehatan yang krusial di masyarakat. Pada perdagangan Senin (27/10/2025), ketika IHSG anjlok 1,87%, sektor kesehatan justru mencatatkan pertumbuhan 1,05%. Tren serupa berlanjut pada perdagangan hari berikutnya, saat IHSG kembali turun 0,30%, sektor kesehatan mampu menguat 2,65%. Retail Research Analyst Sinarmas Sekuritas Cindy Alicia Ramadhania menilai di tengah pe"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/192/1924690/hm-sampoerna-hmsp-kantongi-laba-bersih-rp451-triliun-per-kuartal-iii2025",
    "source": "https://market.bisnis.com/read/20251030/192/1924690/hm-sampoerna-hmsp-kantongi-laba-bersih-rp451-triliun-per-kuartal-iii2025",
    "summary": "PT Hanjaya Mandala Sampoerna Tbk (HMSP) reported a net profit of Rp4.51 trillion for the third quarter of 2025, a decrease of 5.34% year-on-year (YoY) compared to Rp88.47 trillion in the same period last year. The company's sales also declined. According to the financial report, HM Sampoerna's clean sales for the January-September 2025 period were Rp83.74 trillion, down from Rp83.74 trillion in the same period last year. The largest sales came from the third-party segment in the domestic market, specifically the Sigaret Kretek Mesin (SKM) segment, which accounted for 54.25% of total sales. Although it was the largest, SKM sales fell 10.06% YoY to Rp45.43 trillion, down from Rp50.51 trillion in the previous period. The sales of SKM also decreased by 57.10% compared to the third quarter"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/192/1924601/jasa-marga-jsmr-cetak-laba-bersih-rp272-triliun-per-kuartal-iii2025",
    "source": "https://market.bisnis.com/read/20251030/192/1924601/jasa-marga-jsmr-cetak-laba-bersih-rp272-triliun-per-kuartal-iii2025",
    "summary": "1. Jasa Marga, a state-owned toll road company in Indonesia, reported a 17.33% decrease in net profit for the third quarter of 2025, with a net profit of Rp2.72 trillion, down from Rp3.3 trillion in the same period last year. The company's revenue fell by 6.11% to Rp21.08 trillion, while toll segment revenue increased by 5.31% to Rp13.41 trillion. Non-toll revenue remained relatively stable at Rp1.10 trillion, down 0.66% year on year. Construction segment revenue, however, declined by 23.72% year on year to Rp6.55 trillion. The company's efficiency improved, with operating expenses falling by 12.68% year on year to Rp12.50 trillion. As a result, gross profit grew by 5.48% year on year to Rp8.57 trillion for the first nine months of 2025. However, after accounting for other income and expenses,"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/192/1924544/optimisme-goto-kerek-target-ebitda-capai-rp19-triliun-tahun-ini",
    "source": "https://market.bisnis.com/read/20251030/192/1924544/optimisme-goto-kerek-target-ebitda-capai-rp19-triliun-tahun-ini",
    "summary": "PT GoTo Gojek Tokopedia Tbk (GOTO) has revised its EBITDA target for the year 2025 to potentially reach between Rp1.8 trillion and Rp1.9 trillion, up from its previous target of Rp1.4 trillion to Rp1.6 trillion for this year. This upward revision is due to the strong financial performance in the first nine months and third quarter of 2025, according to Patrick Walujo, GoTo's Chief Executive Officer. The company is consistently growing and improving profitability as it strives to become a global-class technology platform used by the Indonesian community. In the third quarter, GoTo reported an adjusted EBITDA of Rp62 billion, marking the first time it has reached such a figure. \"Through this momentum, we are raising our EBITDA guidance for the full year to between Rp1.8 trillion and Rp1.9 trillion, which reinforces our confidence in our ability to create sustainable growth and long-term value for all stakeholders,\" said Patrick in a press release quoted by Bisnis.com on Thursday (30/1"
  },
  {
    "title": "Source: https://market.bisnis.com/read/20251030/235/1924522/harga-emas-perhiasan-hari-ini-30-oktober-berbalik-naik-rp2055-juta-per-gram",
    "source": "https://market.bisnis.com/read/20251030/235/1924522/harga-emas-perhiasan-hari-ini-30-oktober-berbalik-naik-rp2055-juta-per-gram",
    "summary": "1. Gold prices for jewelry rebounded today, with 24-karat gold selling for Rp2.055 million per gram at Raja Emas and Rp365,000 per gram for 5-karat gold. At Lakuemas, 24-karat gold is priced at Rp1.888 million per gram.\n    2. This market context suggests a recovery in gold prices after a recent downtrend, potentially due to increased demand or reduced supply.\n    3. The potential implications of this price increase could be increased spending on jewelry items, as well as increased investment in gold as a safe haven asset, given the current economic uncertainty."
  },
  {
    "title": "Emiten Grup Lippo (MLPT) Bagi Dividen, Investor Dapat Rp53,5/ SahamMarket3 jam yang lalu",
    "source": "https://www.cnbcindonesia.com/market/20251030143353-17-680736/emiten-grup-lippo--mlpt--bagi-dividen-investor-dapat-rp535--saham",
    "summary": "1. PT Multipolar Technology (MLPT), a technology affiliate of the Lippo Group, announced an interim dividend of Rp53.5 per share for the 2025 fiscal year, equivalent to a dividend yield of 0.06% based on the closing price of MLPT at Rp84,800 per share on Tuesday (28/10). The ex-dividend date is set for November 6, 2025, with payment on November 28, 2025.\n    2. Despite a decrease in net income to Rp241.3 billion as of September 30, 2025, down 18.16% year-on-year (yoy) from Rp294.8 billion, MLPT's revenue has increased to Rp2.72 trillion in the third quarter of 2025, up 10.01% year-on-year from Rp2.47 trillion.\n    3. The increase in revenue is attributed to technology services, contributing Rp1.18 trillion, and revenue from"
  },
  {
    "title": "Emiten Sandiaga Uno (TBIG) Jual 350 Juta Saham, Raup Duit Rp749 MiliarMarket3 jam yang lalu",
    "source": "https://www.cnbcindonesia.com/market/20251030142208-17-680728/emiten-sandiaga-uno--tbig--jual-350-juta-saham-raup-duit-rp749-miliar",
    "summary": "1. Sandiaga Uno's affiliated company, PT Tower Bersama Infrastructure (TBIG), has sold 350 billion rupiah worth of treasury shares to Bersama Digital Infrastructure Asia Pte Ltd. The shares were sold at a price of 2.138 rupiah each, totaling 749 billion rupiah. This transaction was conducted on October 27, 2025, and was previously announced, although the execution price was not disclosed. Previously, TBIG had also sold shares resulting from a buyback to the controller, and this was done through the trading market on September 4 and 6, 2023. A total of 81,585,300 shares were successfully re-sold, at a price of 2.055 rupiah per share, resulting in a value of 165.65 billion rupiah. If calculated, TBIG received a profit of 2.08 billion rupiah from this share sale. However, there are still 20,460,700 shares from the buyback that need to"
  },
  {
    "title": "IHSG Rebound, Cek Rekomendasi Saham yang Patut Dilirik Hari IniMarket11 jam yang lalu",
    "source": "https://www.cnbcindonesia.com/market/20251030081659-52-680566/ihsg-rebound-cek-rekomendasi-saham-yang-patut-dilirik-hari-ini",
    "summary": "1. The Jakarta Composite Index (IHSG) closed up 0.91% to 8,166.22 on Tuesday (29/10), driven by large banking stocks like BBCA (+3.93%) and BMRI (+3.10%), as well as mining stock BRMS (+8.77%). Conversely, TLKM (-3.24%), DSSA (-3.53%), and BREN (-1.69%) experienced declines. Domestic investors and foreign investors collectively bought Rp1,23 trillion and Rp3.79 trillion, respectively, in the regular market and overall market. Sector-wise, 7 out of 11 sectors closed in the green, with the basic materials sector recording the highest increase of 3.44%, while the industrial sector declined by 0.95%.\n    2. Domestic company PT Bukalapak.com Tbk (BUKA) reported a net profit of Rp2.90 trillion for the first nine months of 2025 (9M25), a reversal from"
  },
  {
    "title": "Asing Diam-Diam Kompak Borong 10 Saham Ini Kala IHSG ReboundMarket11 jam yang lalu",
    "source": "https://www.cnbcindonesia.com/market/20251030074058-17-680549/asing-diam-diam-kompak-borong-10-saham-ini-kala-ihsg-rebound",
    "summary": "1. The Jakarta Composite Index (IHSG) rebounded after two consecutive days of decline, closing 0.91% higher at 8,166.22. The total value of transactions reached IDR 22.72 trillion, involving 28.37 billion shares in 2.24 million transactions. 355 stocks rose, 316 fell, and 140 remained unchanged. Foreign investors were observed to make large-scale purchases, amounting to IDR 3.79 trillion across all markets. IDR 1.23 trillion was in the regulated market, and IDR 2.55 trillion was in the negotiation and cash market. Which stocks were heavily bought by foreign investors, driving the IHSG's movement? According to Stockbit, here are the top 10: 1. PT Bank Central Asia Tbk. (BBCA) - IDR 976.47 billion 2. PT Bank Mandiri (Persero) Tbk. (BMRI) - IDR 237.50 billion 3. PT Alamt"
  },
  {
    "title": "Net Buy Jumbo Rp3,79 T, Asing Terciduk Malah Lego 10 Saham IniMarket12 jam yang lalu",
    "source": "https://www.cnbcindonesia.com/market/20251030071641-17-680544/net-buy-jumbo-rp379-t-asing-terciduk-malah-lego-10-saham-ini",
    "summary": "1. The Jakarta Composite Index (IHSG) rebounded after two consecutive days of closing in the red, ending the session up 0.91% at 8,166.22. The total value of transactions reached Rp 22.72 trillion, involving 28.37 billion shares in 2.24 million transactions. 355 stocks rose, 316 fell, and 140 remained unchanged.\n    2. Foreign investors were observed to make clean buy jumbo transactions worth Rp3.79 trillion across the market. This includes Rp1.23 trillion in the regular market and Rp2.55 trillion in the negotiated and cash market. Additionally, a number of stocks were compactly listed in the sell foreigner queue. According to Stockbit, here are the net foreign sell transactions for Wednesday! 1. PT Bank Rakyat Indonesia (Persero) Tbk. (BBRI) - Rp174.01 billion 2. PT Bumi Resources Tbk. (BUMI) - Rp87.62 billion 3. PT Ind"
  }
]